# Data Cleaning

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
(df["Cabin"].isnull().sum() /891)*100 # in Cabin column there are 77% missing values so we will drop it

77.10437710437711

# Cleaning

In [6]:
# Remove passenger id ---> it will not help in our analysis
# Remove Cabin column ---> coz it has 70% of missing values 
# we can change data type of Survival , Pclass , Sex column's into category datatype
# join SibSp and Parch column and make one feature enginnering variable called Family_Size
# age and embabrked column is having missing values 
# Round up the value of age column and make it integer data type
# Embarked is having 2 missing values so fill it

In [7]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
df.drop(columns=['PassengerId' ,'Cabin' ] , inplace = True)

In [9]:
df.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Embarked     object
dtype: object

In [10]:
df["Survived"]=df["Survived"].astype("category")
df["Pclass"]=df["Pclass"].astype("category")
df["Sex"]= df["Sex"].astype("category")
df["Embarked"]= df["Embarked"].astype("category")

In [11]:
df.dtypes

Survived    category
Pclass      category
Name          object
Sex         category
Age          float64
SibSp          int64
Parch          int64
Ticket        object
Fare         float64
Embarked    category
dtype: object

In [12]:
df["family_size"] = df["SibSp"] + df["Parch"]

In [13]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,family_size
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0

In [14]:
# we will replace age null value with the avg value 
df["Age"].fillna(df["Age"].mean() , inplace=True)

In [15]:
df["Age"].isnull().sum()

0

In [16]:
df.isnull().sum()

Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
family_size    0
dtype: int64

In [17]:
df["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [18]:
# most of the peoples are travelling for S city embarked and that why i am replacing the null values by "S"
df["Embarked"].fillna("S" , inplace = True)

In [19]:
df.isnull().sum() # here i remove all the missing values over here

Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
family_size    0
dtype: int64

In [20]:
# Round up the value of age column and make it integer data type
df["Age"] = df["Age"].apply(lambda x: round(x))

In [21]:
# make dtype of age into integer 
df["Age"] = df["Age"].astype("int")

In [22]:
df.dtypes

Survived       category
Pclass         category
Name             object
Sex            category
Age               int32
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Embarked       category
family_size       int64
dtype: object

In [23]:
# remove SibSp and Parch ----> coz i have made feature engineering varile called family_size so no need to keep this two columns 
df.drop(columns=["SibSp" , "Parch"] , inplace=True)

In [24]:
df.head()

,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,family_size
0,0,3,"Braund, Mr. Owen Harris",male,22,A/5 21171,7.2500,S,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,PC 17599,71.2833,C,1
2,1,3,"Heikkinen, Miss. Laina",female,26,STON/O2. 3101282,7.9250,S,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,113803,53.1000,S,1
4,0,3,"Allen, Mr. William Henry",male,35,373450,8.0500,S,0

In [25]:
# Name column 
#df["Name"] = df["Name"].str.lower()

In [26]:
#df["SurName"] = df["Name"].str.strip().str.split(",").str.get(0)

In [27]:
#df["FirstName"] = df["Name"].str.strip().str.split(",").str.get(1)

In [28]:
#df.drop(columns=["" , "SurName" ,"FirstName"] , inplace=True)

In [29]:
#df["Mr and Miss"] = df["FirstName"].str.strip().str.split(".").str.get(0)

In [30]:
df.head()

,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Embarked,family_size
0,0,3,"Braund, Mr. Owen Harris",male,22,A/5 21171,7.2500,S,1
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,PC 17599,71.2833,C,1
2,1,3,"Heikkinen, Miss. Laina",female,26,STON/O2. 3101282,7.9250,S,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,113803,53.1000,S,1
4,0,3,"Allen, Mr. William Henry",male,35,373450,8.0500,S,0

In [31]:
df.insert(3,"FirstName" ,df["Name"].str.strip().str.split(",").str.get(1))

In [32]:
df.insert(4,"SurName" ,df["Name"].str.strip().str.split(",").str.get(0))

In [33]:
df.insert(2,"Mr & Miss" ,df["FirstName"].str.strip().str.split(".").str.get(0))

In [34]:
df.drop(columns="Name" , inplace = True)

In [35]:
df.rename(columns={"SurName":"LastName"} , inplace=True)

In [36]:
df.head()

,Survived,Pclass,Mr & Miss,FirstName,LastName,Sex,Age,Ticket,Fare,Embarked,family_size
0,0,3,Mr,Mr. Owen Harris,Braund,male,22,A/5 21171,7.2500,S,1
1,1,1,Mrs,Mrs. John Bradley (Florence Briggs Thayer),Cumings,female,38,PC 17599,71.2833,C,1
2,1,3,Miss,Miss. Laina,Heikkinen,female,26,STON/O2. 3101282,7.9250,S,0
3,1,1,Mrs,Mrs. Jacques Heath (Lily May Peel),Futrelle,female,35,113803,53.1000,S,1
4,0,3,Mr,Mr. William Henry,Allen,male,35,373450,8.0500,S,0

In [37]:
a = df["Mr & Miss"].value_counts()
a

Mr              517
Miss            182
Mrs             125
Master           40
Dr                7
Rev               6
Mlle              2
Major             2
Col               2
the Countess      1
Capt              1
Ms                1
Sir               1
Lady              1
Mme               1
Don               1
Jonkheer          1
Name: Mr & Miss, dtype: int64

In [38]:
def title(name):
    if name == "Mrs":
        return "Miss"
    elif name == "Master":
        return "Mr"
    elif name =="Mlle":
        return "Miss"
    elif name == "the Countess":
        return "Miss"
    elif name == "Ms":
        return "Miss"
    elif name == "Lady":
        return "Miss"
    elif name == "Mme":
        return "Miss"
    elif name =="Don":
        return "Mr"
    elif name =="Jonkheer":
        return "Mr"
    elif name == "Rev":
        return "Mr"
    elif name =="Sir":
        return "Mr"
    else:
        return name

In [39]:
df["Mr & Miss"] = df["Mr & Miss"].apply(title)

In [40]:
df["FirstName"] = df["FirstName"].str.strip().str.split(".").str.get(1)

In [43]:
df["Mr & Miss"].value_counts()

Mr       566
Miss     313
Dr         7
Major      2
Col        2
Capt       1
Name: Mr & Miss, dtype: int64

In [45]:
df.isnull().sum()

Survived       0
Pclass         0
Mr & Miss      0
FirstName      0
LastName       0
Sex            0
Age            0
Ticket         0
Fare           0
Embarked       0
family_size    0
dtype: int64

In [46]:
df.head()

,Survived,Pclass,Mr & Miss,FirstName,LastName,Sex,Age,Ticket,Fare,Embarked,family_size
0,0,3,Mr,Owen Harris,Braund,male,22,A/5 21171,7.2500,S,1
1,1,1,Miss,John Bradley (Florence Briggs Thayer),Cumings,female,38,PC 17599,71.2833,C,1
2,1,3,Miss,Laina,Heikkinen,female,26,STON/O2. 3101282,7.9250,S,0
3,1,1,Miss,Jacques Heath (Lily May Peel),Futrelle,female,35,113803,53.1000,S,1
4,0,3,Mr,William Henry,Allen,male,35,373450,8.0500,S,0

In [47]:
df.to_csv("Titanic_Cleaned_Data.csv")